# Group By
This method allows us to group rows of data together and call aggregate functions.

In [4]:
import pandas as pd
import numpy as np

In [8]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [10]:
df = pd.DataFrame(data=data)

In [13]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [31]:
# Groupby a Company column 
by_company = df.groupby("Company")

In [37]:
# Now we are ready to use aggregation methods such as mean,...
by_company.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [41]:
# Returns the result as a Series
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [43]:
# Returns the result as a DataFrame instead of a Series

df.groupby('Company')[['Sales']].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [47]:
# calculates the standard deviation 
by_company.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [49]:
by_company.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [51]:
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [55]:
by_company.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [59]:
by_company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [69]:
# his returns a new DataFrame where each company is an index.
by_company.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [71]:
# loc['FB'] retrieves the row where the index is 'FB'.
by_company.sum().loc['FB']
# Since by_company.sum() returns a DataFrame with companies as the index, 
# this extracts the summed values for Facebook (FB).

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [65]:
# provides summary statistics for each group in a transposed format.
by_company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [67]:
# Describe a selected column
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [75]:
by_company.mean(numeric_only=True).info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, FB to MSFT
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   3 non-null      float64
dtypes: float64(1)
memory usage: 156.0+ bytes